Documents/СнятиеРаспределенияЗаказовПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СнятиеРаспределенияЗаказовПокупателя</Name>
			<Comment>Снятие распределения заказов покупателя</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказВнутренний</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРаспределение</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Покупатель, чьи заказы снимаются с резерва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗаказа</Name>
					<Comment>Корректировка заказа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Снимаемые резервы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщика</Name>
							<Comment>Заказ поставщику, на который распределены заказы покупателей</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Comment>Заказ, под который распределен заказ поставщика</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаказыРаспределение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыРаспределение</Name>
			<Comment>Хранит состояние распределения ожидаемых заказов поставщиков, покупателей и подразделений</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество распределенной номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Comment>Заказ, под который распределен заказ поставщика</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщика</Name>
					<Comment>Заказ поставщику, на который распределены заказы покупателей</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КорректировкаДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КорректировкаДвижений</Name>
			<Comment>Корректировка движений документов</Comment>
			<BasedOn>
				<xr:Item>Document.АктПриемаПередачиЦенныхБумаг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.Амортизация</xr:Item>
				<xr:Item>Document.БюджетДДС</xr:Item>
				<xr:Item>Document.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>Document.БюджетЗакупок</xr:Item>
				<xr:Item>Document.БюджетПродаж</xr:Item>
				<xr:Item>Document.ВводОстатковВзаиморасчетов</xr:Item>
				<xr:Item>Document.ВводВЭксплуатацию</xr:Item>
				<xr:Item>Document.ВводОстатковПрочихАктивов</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.Взаимозачет</xr:Item>
				<xr:Item>Document.Выписка</xr:Item>
				<xr:Item>Document.ВыплатаЗарплаты</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказВнутренний</xr:Item>
				<xr:Item>Document.ЗакрытиеСмены</xr:Item>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ИзменениеЦен</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияОрдерногоСклада</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПоставщику</xr:Item>
				<xr:Item>Document.ОбслуживаниеАктива</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПокупателя</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ПеремещениеАктивов</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.Переоценка</xr:Item>
				<xr:Item>Document.ПереоценкаВалютныхСредств</xr:Item>
				<xr:Item>Document.ПереразмещениеТоваров</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ПланФакт</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.РезервированиеЗаказовПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРезервовЗаказовПокупателя</xr:Item>
				<xr:Item>Document.СписаниеАктивов</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
				<xr:Item>Document.СчетФактураВыданный</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.ЧекНаОплату</xr:Item>
				<xr:Item>Document.ЗакрытиеПериода</xr:Item>
				<xr:Item>Document.НазначениеСкидокСтроки</xr:Item>
				<xr:Item>Document.НазначениеСкидокШапки</xr:Item>
				<xr:Item>Document.РаспределениеЗаказаПокупателя</xr:Item>
				<xr:Item>Document.ВводОстатковНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходДС</xr:Item>
				<xr:Item>Document.ПланПоступленияДС</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРаспределенияЗаказовПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеРезервов</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПоставщику</xr:Item>
				<xr:Item>Document.КорректировкаПоступления</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетОказанияУслугПоАвтоработам</xr:Item>
				<xr:Item>AccumulationRegister.Субподряд</xr:Item>
				<xr:Item>AccumulationRegister.АвтомобилиДляТестДрайва</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДДС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПутиПартии</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.БюджетЗакупокАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.БюджетЗакупок</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарь</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ГТДПартийТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.КассыККМ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАвтомобилейОрдерныйСклад</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияСотрудникамПоЗаказНарядам</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРаспределение</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеАвтомобили</xr:Item>
				<xr:Item>AccumulationRegister.АвтомобилиОтданные</xr:Item>
				<xr:Item>AccumulationRegister.БонусныеБаллы</xr:Item>
				<xr:Item>AccumulationRegister.МаркировкаТоваровВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОтданные</xr:Item>
				<xr:Item>AccumulationRegister.КомплектацияАвтомобилей</xr:Item>
				<xr:Item>InformationRegister.ОперацииПрослеживаемыхТоваров</xr:Item>
				<xr:Item>AccumulationRegister.НакопленияПоКарточкамКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПродажАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровОрдерныйСклад</xr:Item>
				<xr:Item>AccumulationRegister.КомпенсацииПоМаркетинговымПрограммам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикамНаАвтомобили</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийКПередаче</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПерерасчетСкидок</Name>
					<Comment>Блокировать перерасчет скидок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвиженияКорректировки</Name>
					<Comment>В этой табличной части хранятся названия регистров накопления участвующих в корректировке</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРегистра</Name>
							<Comment>Имя регистра накопления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление регистра накопления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Использование</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеРаспределенияЗаказовПокупателя/Ext/ManagerModule.bsl
// Модуль менеджера документа "Снятие распределения заказа покупателя"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	 Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст = 
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(ПодразделениеКомпании)
		|	И ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)";
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные = Ложь) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Заполняет табличную часть данными
//
// Параметры:
// Основание	- ДокументСсылка - Ссылка на документ-основание.
//
Процедура ЗаполнитьТабличнуюЧасть(Объект, Основание = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаМомент", ?(Объект.Ссылка.Пустая(), Объект.Дата, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	ТекстОтбора     = "";
	ТекстПараметров = "";
	
	Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика Тогда
		Если Основание = Неопределено Тогда
			ТекстОтбора = "ГДЕ
			|	ВЫРАЗИТЬ(ЗаказыРаспределениеОстатки.ЗаказПоставщика КАК Документ.ЗаказПоставщику).Контрагент = &Контрагент";
		КонецЕсли;
		ТекстПараметров = "ЗаказПоставщика ССЫЛКА Документ.ЗаказПоставщику";
	Иначе
		Если Основание = Неопределено Тогда
			ТекстОтбора = "ГДЕ
			|	ВЫРАЗИТЬ(ЗаказыРаспределениеОстатки.ЗаказПоставщика КАК Документ.ЗаказВнутренний).ПодразделениеПолучатель = &Контрагент";
		КонецЕсли;
		ТекстПараметров = "ЗаказПоставщика ССЫЛКА Документ.ЗаказВнутренний";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказВнутренний") Тогда
			Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика Тогда
				ТекстПараметров = ТекстПараметров + "
				|	И ЗаказПокупателя = &Основание";
			Иначе
				ТекстПараметров = ТекстПараметров + "
				|	И ЗаказПоставщика = &Основание";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика Тогда
				ТекстПараметров = ТекстПараметров + "
				|	И ЗаказПоставщика = &Основание";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ТекстПараметров = ТекстПараметров + "
			|	И ЗаказПокупателя = &Основание";
		КонецЕсли;
		Запрос.УстановитьПараметр("Основание", Основание);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыРаспределениеОстатки.ЗаказПокупателя,
	|	ЗаказыРаспределениеОстатки.ЗаказПоставщика,
	|	ЗаказыРаспределениеОстатки.Номенклатура,
	|	ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыРаспределениеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыРаспределение.Остатки(&НаМомент,
	|	" + ТекстПараметров + ") КАК ЗаказыРаспределениеОстатки
	|	" + ТекстОтбора + "
	|";
	
	Объект.Товары.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока);
		Если (НЕ НоваяСтрока.Коэффициент = 0) И (НЕ НоваяСтрока.Коэффициент = 1) Тогда
			НоваяСтрока.Количество = Окр(НоваяСтрока.Количество / НоваяСтрока.Коэффициент, 3);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("Контрагент");
	
	Если НЕ ПраваИНастройкиПользователя.Значение("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	ОбязательныеРеквизиты.Добавить("Товары.ЕдиницаИзмерения");
	ОбязательныеРеквизиты.Добавить("Товары.Коэффициент");
	ОбязательныеРеквизиты.Добавить("Товары.ЗаказПоставщика");
	ОбязательныеРеквизиты.Добавить("Товары.ЗаказПокупателя");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	УникальныеТовары.Добавить("ЕдиницаИзмерения");
	УникальныеТовары.Добавить("ХарактеристикаНоменклатуры");
	УникальныеТовары.Добавить("ЗаказПоставщика");
	УникальныеТовары.Добавить("ЗаказПокупателя");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти = Новый Структура();
	УникальныеТабличныеЧасти.Вставить("Товары",УникальныеТовары);
	
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
		
	КонтролируемыеРеквизитыТЧ = Новый Структура();
	КонтролируемыеРеквизитыТЧ.Вставить("ЗаказПоставщика", КонтрольПоПодразделению);
	КонтролируемыеРеквизитыТЧ.Вставить("ЗаказПокупателя", КонтрольПоПодразделению);
	
	КонтролируемыеРеквизиты.Вставить("Товары", КонтролируемыеРеквизитыТЧ);

	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()

#КонецОбласти

#Область ОбработчикиИзмененияДанныхОбъекта

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	ПараметрыДействия.Вставить("ПересчетСуммы",  Ложь);

	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика Тогда
		Если ТипЗнч(Объект.Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонтрагентПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияВнутреннего Тогда
		Если ТипЗнч(Объект.Контрагент) <> Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			Объект.Контрагент = Справочники.ПодразделенияКомпании.ПустаяСсылка();
			КонтрагентПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	ЗаполнитьТабличнуюЧасть(Объект, Объект.ДокументОснование);
	
КонецПроцедуры // КурсДокументаПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика И НЕ ЗначениеЗаполнено(Строка.ЗаказПоставщика) Тогда
				Строка.ЗаказПоставщика = Объект.ДокументОснование;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда
				Строка.ЗаказПокупателя = Объект.ДокументОснование;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказВнутренний") Тогда
			
			Если Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика И НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя)  Тогда
				Строка.ЗаказПокупателя = Объект.ДокументОснование;
			ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.СнятиеРаспределенияПоставщика И НЕ ЗначениеЗаполнено(Строка.ЗаказПоставщика)  Тогда
				Строка.ЗаказПоставщика = Объект.ДокументОснование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеХарактеристикаНоменклатуры(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеЕдиницаИзмерения(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
	Если ЗаполнениеОбъектовАльфаАвто.ВозможнаРаботаТСД() Тогда
		ЗаполнениеОбъектовАльфаАвто.ДобавитьКомандыРаботыСТСД(КомандыЗаполнения, "Товары");
	КонецЕсли;
	
	ЗаполнениеОбъектовАльфаАвто.ДобавитьКомандуОчиститкиТабличнойЧасти(КомандыЗаполнения, "Товары");
	
	ОтображатьЗаполнитьИзФайла = ПраваИНастройкиПользователя.Значение("ОтображатьЗаполнитьИзФайла", "СнятиеРаспределенияЗаказовПокупателя");
	Если ОтображатьЗаполнитьИзФайла Тогда
		ЗаполнениеОбъектовАльфаАвто.ДобавитьКомандуЗаполненияТабличнойЧастиИзФайла(КомандыЗаполнения, "Товары");
	КонецЕсли;
	
	Команда 				= ЗаполнениеОбъектовАльфаАвто.ДобавитьКоманду(КомандыЗаполнения);
	Команда.Представление	= НСтр("ru = 'Заполнить по основанию'");
	Команда.Идентификатор	= "ТоварыЗаполнитьПоОснованию";
	
	ВыборКонтрагента 					= ПоследовательныеОперацииКлиентСервер.НовыйВыборСсылки();
	ВыборКонтрагента.ВыборСсылки 		= "Справочник.Контрагенты.ФормаСписка";
	ВыборКонтрагента.Обязательный 		= Истина;
	ВыборКонтрагента.ТекстОтменыВвода 	= НСтр("ru = 'Необходимо выбрать контрагента.'");
	
	Команда 				= ЗаполнениеОбъектовАльфаАвто.ДобавитьКоманду(КомандыЗаполнения);
	Команда.Представление	= НСтр("ru = 'Заполнить по контрагенту'");
	Команда.Идентификатор	= "ТоварыЗаполнитьПоКонтрагенту";
	Команда.Порядок			= 51;
	Команда.ДополнительныеПараметры.ПоследовательныеОперации.Вставить("Контрагент", ВыборКонтрагента);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоОснованию.Видимость",     Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоОснованию.Доступность",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоКонтрагенту.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоКонтрагенту.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа по документу основанию
//
Функция ТоварыЗаполнитьПоОснованию(Ссылка, ПараметрыКоманды, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыЗаполнения = ПараметрыКоманды.ОписаниеКоманды.ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	Объект				= ПараметрыКоманды.Источник;
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьТабличнуюЧасть(Объект, Объект.ДокументОснование);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен документ основание.'"), Ссылка);
	КонецЕсли;

КонецФункции // ТоварыЗаполнитьПоОснованию()

// Обработчик заполнения документа по контрагенту
//
Функция ТоварыЗаполнитьПоКонтрагенту(Ссылка, ПараметрыКоманды, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыЗаполнения = ПараметрыКоманды.ОписаниеКоманды.ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	Объект				= ПараметрыКоманды.Источник;
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Произведем корректировку значений реквизитов объекта в соответствии с параметрами заполнения.
	Если НЕ Объект.Контрагент=ПараметрыЗаполнения.Контрагент Тогда
		Объект.Контрагент = ПараметрыЗаполнения.Контрагент;
		КонтрагентПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	ЗаполнитьТабличнуюЧасть(Объект);
	
КонецФункции // ТоварыЗаполнитьПоКонтрагенту()

#КонецОбласти

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.СнятиеРаспределенияЗаказовПокупателя",
		"ПФ_MXL_СнятиеРаспределенияЗаказовПокупателя",
		НСтр("ru = 'Снятие распределения заказов покупателя'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
// Параметры:
//  МассивОбъектов - Массив - список объектов, для которых была выполнена процедура Печать;
//  ПараметрыПечати - Структура - произвольные параметры, переданные при вызове команды печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - содержит табличные документы и дополнительную информацию;
//  ОбъектыПечати - СписокЗначений - соответствие между объектами и именами областей в табличных документах, где
//                                   значение - Объект, представление - имя области с объектом в табличных документах;
//  ПараметрыВывода - Структура - параметры, связанные с выводом табличных документов:
//   * ПараметрыОтправки - Структура - информация для заполнения письма при отправке печатной формы электронной почтой.
//                                     Содержит следующие поля:
//    ** Получатель - Строка, СписокЗначений, Массив - список получателей письма;
//    ** Тема - Строка - Тема письма,
//    ** Текст - Строка - Текст письма.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СнятиеРаспределенияЗаказовПокупателя") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_СнятиеРаспределенияЗаказовПокупателя",
															НСтр("ru = 'Снятие распределения заказов покупателя'"),
															ПечатьСнятиеРаспределенияЗаказовПокупателя(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// Формирует печатную форму "СнятиеРаспределенияЗаказовПокупателя"
//
Функция ПечатьСнятиеРаспределенияЗаказовПокупателя(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СнятиеРаспределенияЗаказовПокупателя_СнятиеРаспределенияЗаказовПокупателя";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати, ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
		
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.СнятиеРаспределенияЗаказовПокупателя.ПФ_MXL_СнятиеРаспределенияЗаказовПокупателя");
		
		ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		// вывод заголовка документа
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		ДополнительныеПараметры = УправлениеПечатьюПлатформа.ПолучитьПараметрыВызоваПредставленияСправочника();
		ДополнительныеПараметры.НаДату = Документ.Дата;
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(
			Документ.Контрагент, , ДополнительныеПараметры);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// готовим шапку
		СтруктураИтоговПоСтранице = Новый Структура();
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// готовим области строки
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			// заполняем данные строки
			СтруктураСтроки 		= УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ, Документ);
			СтруктураСтроки.Вставить("ЗаказПокупателя",
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(СтрокаТЧ.ЗаказПокупателя));
			СтруктураСтроки.Вставить("ЗаказПоставщика",
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(СтрокаТЧ.ЗаказПоставщика));
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТЧ) = ВыборкаТабличнойЧасти.Количество() - 1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока,
				ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, , Документ, мсвДопОбластиПодвала);
			
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред		  = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.
			ВывестиИтогиПоСтранице(ТабличныйДокумент, ОбластьИтогоПоСтранице, СтруктураИтоговПоСтранице, Документ);
		КонецЕсли;
		
		УправлениеПечатьюПлатформа.
		ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, , Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСнятиеРаспределенияЗаказовПокупателя()

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ОбъектыВводимыеНаОсновании = Новый Массив();
	ОбъектыВводимыеНаОсновании.Добавить(Документы.КорректировкаДвижений);
	ОбъектыВводимыеНаОсновании.Добавить(Документы.Событие);
	
	Для Каждого ОбъектВводимыйНаОсновании Из ОбъектыВводимыеНаОсновании Цикл
		ОбъектВводимыйНаОсновании.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЦикла;

КонецПроцедуры

// Заполняет список команд создания на основании.
//
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//	 КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат СозданиеНаОснованииАльфаАвто.ДобавитьКомандуСозданияНаОсновании(КомандыСоздатьНаОсновании,
		Метаданные.Документы.СнятиеРаспределенияЗаказовПокупателя);

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
